# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.3.0.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1HMcV-C9m9yIIWQ4KwDnRIoho9dRHgBc-

ФИО
"""

# Лобова Кристина Михайловна

"""**Во всей практике нельзя применять библиотеки предоставляющие готовые решения!**

# **Задача 1.**

Типы данных Напишите программу на Python, которая принимает список чисел в качестве входных данных от пользователя, а затем выводит сумму, среднее значение и максимальное значение из списка.

Дано:
```
1 2 3 4 5 6 7
```
Вывод:

```
Сумма чисел: 28
Среднее арифм.: 4.0
Максимальное значение: 7
```
"""

print("Введите список чисел через пробел:")
num=input()
all=num.split()
sum=0
arif=0
max=0
for x in all:
    x=int(x)
    sum+=x
    arif+=x
    if x>max:
      max=x
print('Сумма чисел:', sum)
print('Среднее арифметическое:', arif/int(len(all)))
print('Максимальное занчение:', max)

"""# **Задача 2.**

Напишите программу на Python, которая принимает список слов в качестве входных данных от пользователя, а затем распечатывает список в обратном порядке.

Ввод:

```
апельсин мандарин яблоко
```

Вывод:

```
яблоко мандарин апельсин
```
"""

print('Введите список слов через пробел:')
words=input()
wordsspace=words.split()
print(wordsspace[::-1])

"""# **Задача 3**

Простой чат-бот
Создайте простого чат-бота, который отвечает на основные запросы пользователей. Программа должна использовать условные выражения для определения намерений пользователя и последующего соответствующего ответа.

Чат бот может:

- помогать складывать числа
- подсказывать фильм, музыку и тд (из заранее созданного списка)
- создавать список дел (а также выводить его, обновлять, очищать)

Интерфейс чат-бота на ваше усмотрение, это могут быть как заранее определенные команды, так и к примеру вызов команды по номеру

*Реализовать без использования функций*

Пример:

Ввод:

```
Олег, какую мызыку посоветуешь?
```

Вывод:

```
Я бы посоветовал вам: Led Zeppelin Stairway to Heaven
```
"""

print('Выберите нужную для вас функцию из списка и напишите ее номер: \n 1) Помоги мне сложить числа. \n 2) Посоветуй фильм. \n 3) Посоветуй музыку. \n 4) Создай список дел.')
request=input()
if '1' in request:
    print('Напишите пример на сложение чисел, который необходимо решить используя только цифры и оператор "+":')
    math=input()
    reshenie=math.split('+')
    answer=0
    for x in reshenie:
        x=int(x)
        answer+=x
    print(answer)

films=['Интерстеллар','Синистер','Моана','Бойцовский клуб','Веном']
import random
if '2' in request:
    var=random.randint(0,4)
    print('Советую вам посмотреть:',films[var])

music=['Imagine Dragons','Дайте танк','Шаман(простите)','Glass animals','Mother Mother']
if '3' in request:
    var1=random.randint(0,4)
    print('Советую вам посмотреть:',music[var1])

if '4' in request:
    print('Введите свой список дел через запятую:')
    spisok=input()
    oform=spisok.split(',')
    for x in oform:
        task=str(oform.index(x)+1)+'.'+str(x)
        print(task)
    print('Что хотите сделать со списком? Выберите нужную функцию и напишите ее номер: \n 1) Очисти список. \n 2) Добавь в список новый пункт.')
    newrequest=input()
    if '1' in newrequest:
        oform.clear()
        print('Список очищен.')
    if '2' in newrequest:
        print('Введите одну задачу, которую необходимо добавить в список:')
        spisok2=input()
        oform.append(spisok2)
        for y in oform:
            task2=str(oform.index(y)+1)+'.'+str(y)
            print(task2)

"""# **Задача 4.**

Камень, ножницы, бумага

Создайте игру в Камень, ножницы, бумагу, в которой пользователь может играть против компьютера. Программа должна запросить выбор пользователя, а затем сгенерировать выбор компьютера. Затем программа должна определить победителя на основе правил игры.

**Этап 1:**

Определение победителя

**Этап 2:**
  
Игра до 3 побед


Вввод для "Этап 1":

```
Камень
```

Вывод:

```
Компьютер: Ножницы
Игрок: Камень
Победа: Игрок
```
"""

import random
player=0
comp=0
selects=['камень','ножницы','бумага']
print('Игра начата. Игра до трех побед. Введите один из трех вариантов с маленькой буквы: \n 1) камень \n 2) ножницы \n 3) бумага')
while player<3 and comp<3:
    playerselect=input()
    select=random.randint(0,2)
    compselect=selects[select]
    print(compselect)
    if playerselect!=compselect:
        if playerselect=='камень' and compselect!='бумага':
            player+=1
            print('Победа игрока. Счет:',player,'/',comp)
        if playerselect=='камень' and compselect=='бумага':
            comp+=1
            print('Победа машин. Счет:',player,'/',comp)
        if playerselect=='бумага' and compselect!='ножницы':
            player+=1
            print('Победа игрока. Счет:',player,'/',comp)
        if playerselect=='бумага' and compselect=='ножницы':
            comp+=1
            print('Победа машин. Счет:',player,'/',comp)
        if playerselect=='ножницы' and compselect!='камень':
            player+=1
            print('Победа игрока. Счет:',player,'/',comp)
        if playerselect=='ножницы' and compselect=='камень':
            comp+=1
            print('Победа машин. Счет:',player,'/',comp)
    else:
        print('ничья')
if player==3:
    player=0
    comp=0
    print('Ура победа!')
if comp==3:
    player=0
    comp=0
    print('И восстали машины из пепла ядерного огня.')

"""# **Задача 6.**

Создайте игру "Палач" или "Виселица", в которой пользователь должен угадать слово, предлагая буквы. Программа должна выбрать случайное слово, а затем разрешить пользователю угадывать буквы. После каждого угадывания программа должна сообщать пользователю, есть ли в слове буква или нет.

**Этап 1**
Создать саму игру

**Этап 2:**
Ввести подсчет количества очков и ограничения на попытки
"""

import random

def hang():
    words=['кукушка','пистолет','компьютер','машина','телефон','парта','вода','убейтеменя']
    rand=random.randint(0,7)
    rand_word=words[rand]
    word_to_guess=set(rand_word)
    used_letters=set()
    attempts=5
    score=0
    print('Игра "Виселица"')
    while attempts>0:
        letters_set=[]
        for letter in rand_word:
            if letter in used_letters:
                letters_set.append(letter)
            else:
                letters_set.append('_')
        if '_' not in letters_set:
            score+=1
            print('Ура, победа! Ваш счёт:',score)
            break
        print('Текущее слово:',' '.join(letters_set))
        print('Попыток осталось:',attempts)
        guessed_letter=input('Введите букву:').lower()
        if guessed_letter in used_letters:
            print('Эта буква уже вводилась!')
            continue
        used_letters.add(guessed_letter)
        if int(len(guessed_letter))!=1:
            print('Ведите одну букву!')
            continue
        if guessed_letter not in word_to_guess:
            attempts-=1
            print('Такой буквы нет!')
        if guessed_letter in word_to_guess:
            word_to_guess.remove(guessed_letter)
    if attempts==0:
            print('Пупупу, вы проиграли:(')

hang()

"""# **Задача 7.**

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции


Вввод:

```
Введите номер позиции: 1234567890
```

Вывод:

```
8
```
"""

