# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.2.0 .ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/11KFm5vVIdLqriSTj_wZPfwyyp1SnpDYP

Напишите свое ФИО:
"""

# Лобова Кристина Михайловна

"""# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print('Привет, мир!')

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

man=input()
print('Привет,',man)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

num=input()
if int(num)%2==0:
  print('четное')
else:
  print('нечетное')

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

print('Введите длинну прямоугольника:')
len=input()
print('Введите ширину прямоугольника:')
shir=input()
print('Площадь прямоугольника:',int(len)*int(shir))

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

a=input()
a1=a.split(',')
summ=0
for x in a1:
    x=int(x)
    summ+=x
print(summ/len(a1))

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""



"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

print('Запишите ряд чисел произвольной длины через запятую БЕЗ ПРОБЕЛОВ:')
rad=input()
if ', ' in rad:
    print('перечитайте условие :)')
rad1=rad.split(',')
summ=''
for x in rad1:
    summ+=x
print('Укажите порядковый номер любой цифры из заданного диапазона, чтобы узнать ee: ',len(summ))
rad2=input()
print(summ[int(rad2)-1])